app/views/gossips/location.html.erb

  <h3><%= city.name %></h3>
  <% city.gossips.each do |gossip| %>
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."city_id" = $1  [["city_id", 1]]

              <%= button_to 'Like', gossip_likes_path(gossip), method: :post %>
              <p><%= gossip.likes.count %> <%= (gossip.likes.count) == 1 ? 'Like' : 'Likes'%></p>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."gossip_id" = $1  [["gossip_id", 1]]