app/views/gossips/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      <p>
          <a href="/author/<%= @gossip.user.id %>"> Son auteur : <%= @gossip.user.first_name %> </a>