app/controllers/gossips_controller.rb

  def location
    @gossips = Gossip.all
    @cities = City.all
---
SELECT "cities".* FROM "cities"

  def create
    city = City.find_by_name(params[:gossip][:city])
    @gossip = current_user.gossips.new(title: params[:gossip][:title], content: params[:gossip][:content], city: city)
    @gossip.save!
---
SELECT "cities".* FROM "cities" WHERE "cities"."name" = $1 LIMIT $2  [["name", "Port Malloryberg"], ["LIMIT", 1]]
INSERT INTO "gossips" ("title", "content", "city_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "jambon"], ["content", "violet gucci jambon bag"], ["city_id", 1], ["user_id", 15], ["created_at", "2020-08-06 21:20:27.238691"], ["updated_at", "2020-08-06 21:20:27.238691"]]

  def update
    # params.delete(:id)
    @gossip = Gossip.find(params[:id])

    if @gossip.update(params.require(:gossip).permit(:title, :content))
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["content", "Five dollar toast lomo semiotics celiac humblebrag mustache skateboard mlkshk ! "], ["updated_at", "2020-08-06 21:14:41.797714"], ["id", 6]]