app/controllers/likes_controller.rb

    def create
        @gossip.likes.create(user_id: current_user.id)
---
INSERT INTO "likes" ("gossip_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["gossip_id", 8], ["user_id", 15], ["created_at", "2020-08-06 21:14:47.605338"], ["updated_at", "2020-08-06 21:14:47.605338"]]

    def find_gossip
        @gossip = Gossip.find(params[:gossip_id])
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]