app/controllers/sessions_controller.rb

        def create
            # cherche s'il existe un utilisateur en base avec l’e-mail
            user = User.find_by(email: params[:user][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "m@mmm.mm"], ["LIMIT", 1]]